---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueElevation
source: html/f0732c3c-0022-6a51-c6e3-944c4287c5ad.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueElevation Property

"End Attachment Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndValueElevation { get; }
```